In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5), index=['Row1','Row2','Row3','Row4'],columns=['Col1','Col2','Col3','Col4','Col5'])
df

      Col1  Col2  Col3  Col4  Col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [3]:
df.head()

      Col1  Col2  Col3  Col4  Col5
Row1     0     1     2     3     4
Row2     5     6     7     8     9
Row3    10    11    12    13    14
Row4    15    16    17    18    19

In [4]:
df.to_csv('test.csv')

In [5]:
df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Col5    4
Name: Row1, dtype: int32

In [6]:
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
df.iloc[0:2,:2]

      Col1  Col2
Row1     0     1
Row2     5     6

In [8]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
Col5    0
dtype: int64

In [9]:
df['Col1'].unique()

array([ 0,  5, 10, 15])

In [10]:
df[['Col2','Col3']]

      Col2  Col3
Row1     1     2
Row2     6     7
Row3    11    12
Row4    16    17

In [11]:
df.describe()

            Col1       Col2       Col3       Col4       Col5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Row1 to Row4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    4 non-null      int32
 1   Col2    4 non-null      int32
 2   Col3    4 non-null      int32
 3   Col4    4 non-null      int32
 4   Col5    4 non-null      int32
dtypes: int32(5)
memory usage: 284.0+ bytes

In [13]:
test_df = pd.read_csv('D:/test.csv',sep=';')

In [14]:
test_df

  Unnamed: 0  Col1  Col2  Col3  Col4  COl5
0       Row1     0     1     2     3     4
1       Row2     2     5     4     8     6
2       Row3     5     6     6     8     6
3       Row4     5     6     8     6     8

In [15]:
test_df = pd.read_csv('D:/test.csv',dtype={'COl1':int,'Col2':float,'Col4':float},sep=';',index_col=0)

In [16]:
test_df

      Col1  Col2  Col3  Col4  COl5
Row1     0   1.0     2   3.0     4
Row2     2   5.0     4   8.0     6
Row3     5   6.0     6   8.0     6
Row4     5   6.0     8   6.0     8

In [17]:
from io import StringIO, BytesIO

In [18]:
data = ('a,b,c\n'
         '4,apple,2.5,\n'
         '6,rat,mat,\n'
         '5,cat,2.0,')
pd.read_csv(StringIO(data))

       a    b   c
4  apple  2.5 NaN
6    rat  mat NaN
5    cat  2.0 NaN

In [19]:
data = ('a,b,c\n'
         '4,apple,2.5,\n'
         '5,cat,2.0,')
pd.read_csv(StringIO(data),index_col=False)

   a      b    c
0  4  apple  2.5
1  5    cat  2.0

## Read JSON Data

In [20]:
Data = '{"employee_name": "Adam","email":"abc@gmail.com","job_profile":[{"title1":"developer","title2":"Sr.developer"}]}'
df1 = pd.read_json(Data)

In [21]:
df1

,employee_name,email,job_profile
0,Adam,abc@gmail.com,"{'title1': 'developer', 'title2': 'Sr.developer'}"

In [23]:
df1.to_json(orient="records")

'[{"employee_name":"Adam","email":"abc@gmail.com","job_profile":{"title1":"developer","title2":"Sr.developer"}}]'

In [24]:
df1.to_json(orient="split")

'{"columns":["employee_name","email","job_profile"],"index":[0],"data":[["Adam","abc@gmail.com",{"title1":"developer","title2":"Sr.developer"}]]}'

In [1]:
import pandas as pd
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
df = pd.read_html(url_mcc, match='Country', header=0)

In [3]:
df[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN